{
  "1": [
    "I used to hate facial hair, but then it grew on me.",
    "I'm reading a book about anti-gravity. It's impossible to put down.",
    "I wondered why the baseball kept getting bigger. Then it hit me.",
    "The math teacher called in sick with algebra.",
    "I lost my job at the bank. A woman asked me to check her balance, so I pushed her over.",
    "Time flies like an arrow. Fruit flies like a banana.",
    "I used to be a banker, but I lost interest.",
    "The graveyard is so crowded, people are dying to get in.",
    "I'm terrified of elevators, so I take steps to avoid them.",
    "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
    "I only know 25 letters of the alphabet. I don't know Y.",
    "What do you call a fish wearing a crown? A king fish.",
    "I'm on a seafood diet. I see food and I eat it.",
    "The early bird might get the worm, but the second mouse gets the cheese.",
    "I used to play piano by ear, but now I use my hands.",
    "What's the best thing about Switzerland? I don't know, but the flag is a big plus.",
    "I haven't slept for ten days",
    "A bicycle can't stand on its own",
    "What do you call a parade of rabbits hopping backwards? A receding hare-line.",
    "I'm reading a book on the history of glue – can't put it down.",
    "What did the ocean say to the beach? Nothing, it just waved.",
    "Why don't scientists trust atoms?",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "What's orange and sounds like a parrot? A carrot.",
    "I used to be addicted to soap, but I'm clean now.",
    "What do you call a sleeping bull? A bulldozer.",
    "Why did the scarecrow win an award? He was outstanding in his field.",
    "What do you call a bear with no teeth? A gummy bear.",
    "I'm afraid for the calendar. Its days are numbered.",
    "What do you call a fake noodle? An impasta.",
    "Why don't eggs tell jokes? They'd crack each other up.",
    "What's the difference between a fish and a piano? You can't tuna fish.",
    "I invented a new word: Plagiarism.",
    "What did one wall say to the other wall? I'll meet you at the corner.",
    "Why did the coffee file a police report? It got mugged.",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks.",
    "I would avoid the sushi if I was you. It's a little fishy.",
    "What do you call a pig that does karate? A pork chop.",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
    "What do you call a factory that makes okay products? A satisfactory.",
    "Dear Math, grow up and solve your own problems.",
    "What did the grape say when it got stepped on? Nothing, it just let out a little wine.",
    "Why don't skeletons fight each other? They don't have the guts.",
    "What's the best way to watch a fly fishing tournament? Live stream.",
    "I'm on a whiskey diet. I've lost three days already.",
    "What do you call a cow with two legs? Lean beef.",
    "I named my horse Mayo. Sometimes Mayo neighs.",
    "What's the difference between a poorly dressed man and a tired dog? One wears a suit, the other pants.",
    "I used to work at a calendar factory but got fired for taking a day off.",
    "What do you call a detective alligator? An investi-gator.",
    "I'm addicted to brake fluid, but I can stop anytime.",
    "What do you call a bee that can't make up its mind? A maybe.",
    "I used to be a shoe salesman, but I lost my sole.",
    "What do you call a rabbit that works in a bakery? A yeasted bunny.",
    "I bought a dog from a blacksmith. As soon as I got home, he made a bolt for the door.",
    "What do you call a factory that makes good products? A satisfactory.",
    "I'm reading a book about mazes. I got lost in it.",
    "What do you call a fish that practices medicine? A sturgeon.",
    "I used to be afraid of hurdles, but I got over it.",
    "What's the best thing about living in Switzerland? Well, the flag is a big plus.",
    "I lost my job as a banker. A woman asked me to check her balance, so I pushed her.",
    "What do you call a sheep with no legs? A cloud.",
    "I used to work in a blanket factory, until it folded.",
    "What do you call a dinosaur that loves to sleep? A dino-snore.",
    "I'm terrified of elevators, so I always take steps to avoid them.",
    "What do you call a belt made out of watches? A waist of time.",
    "I used to be a banker, but then I lost interest.",
    "What's the difference between a cat and a comma? A cat has claws at the end of paws, and a comma is a pause at the end of a clause.",
    "I bought some shoes from a drug dealer. I don't know what he laced them with, but I was tripping all day.",
    "What did the grape say when it got stepped on? Nothing, but it let out a little wine.",
    "I'm reading a book on the history of glue. I just can't seem to put it down.",
    "What do you call a fish wearing a bowtie? Sofishticated.",
    "Why did the scarecrow win an award?",
    "What do you call a cow with a twitch? Beef jerky.",
    "I told a chemistry joke, but there was no reaction.",
    "What do you call a pile of cats? A meowtain.",
    "I used to be a tailor, but I wasn't suited for it.",
    "What do you call a deer with no eyes? No-eye-deer.",
    "I'm reading a book about teleportation. It's bound to take me places.",
    "What do you call a fish that needs help with vocals? Auto-tuna.",
    "I used to work at a bank, but a woman asked me to check her balance, so I pushed her over.",
    "I'm afraid for the calendar",
    "What do you call a bear",
    "I used to work at a shoe recycling shop. It was sole destroying.",
    "What do you call a group of disorganized cats? A cat-astrophe.",
    "I'm addicted to collecting vintage timepieces. It's about time.",
    "What do you call a cow that can play a musical instrument? A moo-sician.",
    "I used to be a banker, but I lost interest in the job.",
    "What's the difference between a well-dressed man on a bicycle and a poorly dressed man on a tricycle? Attire.",
    "I told my wife she should embrace her mistakes. She gave me a hug.",
    "What do you call a fish with no eyes? Fsh.",
    "I'm reading a book about reverse psychology. Do not read it.",
    "What do you call a belt made of watches? A waist of time.",
    "I used to work in a blanket factory, but it folded.",
    "I'm afraid of speed bumps, but I'm slowly getting over it.",
    "What do you call a dog that can do magic? A labracadabrador.",
    "I'm reading a book about parallel lines. They'll never meet.",
    "What do you call a train carrying bubblegum? A chew-chew train.",
    "I used to work in a mirror factory, but I could see myself doing something else.",
    "What do you call a computer that sings? A Dell.",
    "I'm reading a book on the history of elevators. It has its ups and downs.",
    "What do you call a cow with a sense of humor? Laughing stock.",
    "What do you call a fish wearing headphones? Bass-boosted.",
    "What do you call a sleepy grizzly bear? A bear minimum.",
    "What do you call a cheese that isn't yours? Nacho cheese.",
    "I used to work at a juice bar, but I got canned.",
    "I'm reading a book about submarines. It's deep.",
    "What do you call a cow on a trampoline? A milkshake.",
    "I used to be afraid of elevators, but I'm taking steps to get over it.",
    "What do you call a sleeping dinosaur? A dino-snore.",
    "I used to work at a shoe store, but I couldn't fit in.",
    "I'm reading a book about gravity. I can't put it down.",
    "What do you call a cow with no legs? Ground beef.",
    "What do you call a bear in the rain? A drizzly bear.",
    "What do you call a nosy pepper? Jalapeño business.",
    "I used to work at a stationery store, but I didn't feel like I was going anywhere.",
    "What do you call a bear with no ears? B.",
    "I'm reading a thriller about an optometrist. It's an eye-opener.",
    "What do you call a cow that doesn't give milk? A milk dud.",
    "I used to be a lifeguard, but this blue kid got me fired.",
    "What do you call a dog that can't bark? A hush puppy.",
    "I told my wife she should do lunges to stay in shape. That would be a big step forward.",
    "I'm reading a book about adhesives. I can't put it down.",
    "What do you call a fish that wears a bowtie? Sofishticated.",
    "What do you call a dog magician? A labracadabrador.",
    "What do you call a fish wearing a crown? King fish.",
    "I used to work at a calendar factory, but I got fired for taking days off.",
    "What do you call a snobby criminal going downstairs? A condescending con descending.",
    "I used to work at a bank, but a woman asked me to check her balance, so I pushed her.",
    "What do you call a psychic midget who escaped from prison? A small medium at large.",
    "What do you call a man with no body and no nose? Nobody knows.",
    "I used to work at a soft drink can crushing company. It was soda pressing.",
    "What do you call a fish that needs help with his vocals? Auto-tuna.",
    "What do you call a Russian tree? Dimitri.",
    "I used to work at a restaurant called 'The Flying Pan.' I had to quit",
    "What do you call a nervous javelin thrower? Shakespeare.",
    "I used to work at a shoe store, but I got the boot.",
    "What do you call a cow with two legs? Your mother-in-law.",
    "I used to work at a dry cleaner, but I got pressed for time.",
    "What do you call a fish",
    "I used to work at a cemetery, but I got fired for not being serious enough.",
    "What do you call a dog that can play guitar? A golden retriever.",
    "I used to work at a candy factory, but I got fired for being too sweet.",
    "What do you call a cow",
    "I used to work at a hotel, but I got fired for not being accommodating.",
    "What do you call a fish",
    "I used to work at a library, but I got fired for being too loud.",
    "What do you call a cow",
    "I used to work at a bakery, but I couldn't make enough dough.",
    "I used to be a banker, but I lost interest.",
    "Time flies like an arrow, fruit flies like a banana.",
    "The math teacher called in sick with algebra.",
    "I wondered why the ball kept getting bigger. Then it hit me.",
    "I'm reading a book about anti-gravity. It's impossible to put down.",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "The early bird might get the worm, but the second mouse gets the cheese.",
    "I haven't slept for ten days, because that would be too long.",
    "What's the best thing about Switzerland? I don't know, but the flag is a big plus.",
    "I'm terrified of elevators, so I take steps to avoid them.",
    "I only know 25 letters of the alphabet. I don't know Y.",
    "I'm on a seafood diet. I see food and I eat it.",
    "I used to play piano by ear, but now I use my hands.",
    "What do you call a fish wearing a crown? A king fish.",
    "What's orange and sounds like a parrot? A carrot.",
    "I used to be addicted to soap, but I'm clean now.",
    "What do you call a sleeping bull? A bulldozer.",
    "What do you call a bear with no teeth? A gummy bear.",
    "I'm afraid for the calendar. Its days are numbered.",
    "What do you call a fake noodle? An impasta."
  ],
  "2": [
    "Why don't scientists trust atoms?",
    "I told my wife she should embrace her mistakes. She hugged me.",
    "What do you call a fake noodle? An impasta!",
    "Why did the scarecrow win an award?",
    "I'm reading a book about anti-gravity. It's impossible to put down!",
    "What do you call a sleeping bull? A bulldozer!",
    "Why don't eggs tell jokes? They'd crack each other up!",
    "What's the difference between a poorly dressed man on a tricycle and a well-dressed man on a bicycle? Attire!",
    "What do you call a bear with no teeth? A gummy bear!",
    "Why did the math book look so sad?",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks!",
    "I'm terrified of elevators, I'll take the stairs instead.",
    "What did the ocean say to the beach? Nothing, it just waved!",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one!",
    "What do you call a factory that sells passable products? A satisfactory!",
    "What's orange and sounds like a parrot? A carrot!",
    "Why did the coffee file a police report? It got mugged!",
    "What do you call a pig that does karate? A pork chop!",
    "I used to play piano by ear. Now I use my hands.",
    "What did one wall say to the other wall? I'll meet you at the corner!",
    "Why don't scientists trust stairs?",
    "What do you call a fish wearing a bowtie? Sofishticated!",
    "What's the best thing about Switzerland? I don't know, but the flag is a big plus!",
    "Why did the bicycle fall over?",
    "What do you call a parade of rabbits hopping backwards? A receding hare-line!",
    "What did the grape say when it got stepped on? Nothing, it just let out a little wine!",
    "Why don't skeletons fight each other? They don't have the guts!",
    "What's the best way to watch a fly fishing tournament? Live stream!",
    "What do you call a cow with no legs? Ground beef!",
    "Why did the cookie go to the doctor?",
    "What's a skeleton's least favorite room in the house? The living room!",
    "I'm reading a book on the history of glue. I just can't seem to put it down!",
    "Why did the tomato turn red?",
    "What do you call a belt made of watches? A waist of time!",
    "What's the difference between a cat and a comma? A cat has claws at the end of paws, and a comma is a pause at the end of a clause!",
    "What do you call a deer with no eyes? No idea!",
    "What do you call a fish that wears a crown? A king fish!",
    "Why did the stadium get hot? All the fans left!",
    "What do you call a boomerang that won't come back? A stick!",
    "I used to be addicted to the Hokey Pokey, but I turned myself around.",
    "What do you call a cow with a twitch? Beef jerky!",
    "Why did the picture go to jail? It was framed!",
    "What do you call a dog magician? A labracadabrador!",
    "What do you call a fish that needs help with vocals? Auto-tuna!",
    "Why did the computer go to the doctor? It had a virus!",
    "What do you call a fake stone? A shamrock!",
    "What do you call a cow that can play a musical instrument? A moo-sician!",
    "Why did the banana go to the doctor? It wasn't peeling well!",
    "What do you call a group of disorganized cats? A cat-astrophe!",
    "Why did the pencil go to school? To get sharper!",
    "What do you call a sleeping dinosaur? A dino-snore!",
    "What do you call a cow on a trampoline? A milkshake!",
    "Why don't oysters share?",
    "What do you call a belt made out of watches? A waist of time!",
    "What do you call a fish",
    "Why did the math teacher call in sick? She had algebra.",
    "What do you call a cow",
    "What do you call a fish",
    "Why did the chicken cross the playground? To get to the other slide!",
    "What do you call a cow",
    "I used to work at a library, but I got shushed too much.",
    "What do you call a fish",
    "Why did the cookie go to school? To become a smart cookie!",
    "What do you call a cow",
    "I used to work at a hotel, but I couldn't handle the suite life.",
    "What do you call a fish",
    "Why did the banana split?",
    "What do you call a cow",
    "I used to work at a candy store, but I got too sweet on the job.",
    "What do you call a fish",
    "Why did the apple go to the gym? To get some core strength!",
    "What do you call a cow",
    "I used to work at a flower shop, but I couldn't handle the pollen pressure.",
    "What do you call a fish",
    "Why did the orange stop rolling? It ran out of juice!",
    "What do you call a cow",
    "I used to work at a clock factory, but I got tired of the time.",
    "What do you call a fish",
    "Why did the grape stop in the middle of the road?",
    "What do you call a cow",
    "I used to work at a paper factory, but it was tearable.",
    "What do you call a fish",
    "Why did the lemon stop rolling? It was sour!",
    "What do you call a cow",
    "I used to work at a rubber band factory, but it was too stretching.",
    "What do you call a fish",
    "Why did the watermelon have a big wedding?",
    "What do you call a cow",
    "I used to work at a mattress factory, but it was a sleepy job.",
    "What do you call a fish",
    "Why did the strawberry cry?",
    "What do you call a cow",
    "I used to work at a pillow factory, but it was too soft.",
    "What do you call a fish",
    "Why did the peach go to the doctor? It had a pit in its stomach!",
    "What do you call a cow",
    "Why don't scientists trust atoms? Because they make up everything!",
    "What do you call a fake noodle? An impasta!",
    "I told my wife she should embrace her mistakes. She hugged me.",
    "Why did the scarecrow win an award? Because he was outstanding in his field!",
    "What do you call a sleeping bull? A bulldozer!",
    "Why don't eggs tell jokes? They'd crack each other up!",
    "What do you call a bear with no teeth? A gummy bear!",
    "Why did the math book look so sad? Because it was full of problems!",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks!",
    "What did the ocean say to the beach? Nothing, it just waved!",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one!",
    "What do you call a factory that sells passable products? A satisfactory!",
    "What's orange and sounds like a parrot? A carrot!",
    "Why did the coffee file a police report? It got mugged!",
    "What do you call a pig that does karate? A pork chop!",
    "What did one wall say to the other wall? I'll meet you at the corner!",
    "What do you call a fish wearing a bowtie? Sofishticated!",
    "Why did the bicycle fall over? Because it was two-tired!",
    "What do you call a parade of rabbits hopping backwards? A receding hare-line!",
    "What did the grape say when it got stepped on? Nothing, it just let out a little wine!"
  ],
  "3": [
    "Why don't scientists trust atoms?",
    "I told my wife she should embrace her mistakes. She gave me a big hug!",
    "What do you call a fake noodle? An impasta!",
    "Why did the scarecrow win an award? He was outstanding in his field, but he was also pretty corny!",
    "I'm reading a book about anti-gravity. It's impossible to put down, just like my dad jokes!",
    "What do you call a sleeping bull? A bulldozer!",
    "Why don't eggs tell jokes? They'd crack each other up and make a real mess!",
    "I used to be a banker, but then I lost interest. Now I'm into currency events!",
    "What do you call a bear with no teeth? A gummy bear!",
    "Why did the math book look so sad?",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks!",
    "What did the ocean say to the beach? Nothing, it just waved! But it was shore thinking about it!",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one!",
    "What do you call a factory that sells passable products? A satisfactory!",
    "What's orange and sounds like a parrot? A carrot! But it's not very talkative!",
    "Why did the coffee file a police report? It got mugged!",
    "What do you call a pig that does karate? A pork chop!",
    "What did one wall say to the other wall? I'll meet you at the corner! They're always supporting each other!",
    "What do you call a fish wearing a bowtie? Sofishticated!",
    "What's the best thing about Switzerland? I don't know, but the flag is a big plus! Their cheese is grate too!",
    "Why did the bicycle fall over? Because it was two-tired!",
    "What do you call a parade of rabbits hopping backwards? A receding hare-line!",
    "What did the grape say when it got stepped on? Nothing, it just let out a little wine! It was crushed!",
    "Why don't skeletons fight each other? They don't have the guts! Plus, they're bone tired!",
    "What's the best way to watch a fly fishing tournament? Live stream! It's reel entertainment!",
    "What do you call a cow with no legs? Ground beef!",
    "Why did the cookie go to the doctor? Because it felt crumbly!",
    "What's a skeleton's least favorite room in the house? The living room! They prefer the dead room!",
    "Why did the tomato turn red? Because it saw the salad dressing!",
    "What do you call a belt made of watches? A waist of time!",
    "What do you call a deer with no eyes? No idea!",
    "Why don't scientists trust stairs? Because they're always up to something! Step by step conspiracy!",
    "What do you call a boomerang that doesn't come back? A stick!",
    "Why did the stadium get hot after the game? All the fans left!",
    "What do you call a can opener that doesn't work? A can't opener!",
    "Why don't oysters share? Because they're shellfish! They clam up when asked to give!",
    "What did the janitor say when he jumped out of the closet? Supplies! He really swept them off their feet!",
    "Why did the picture go to jail? Because it was framed!",
    "What do you call a dog magician? A labracadabrador!",
    "Why don't scientists trust atoms? They make up everything and split when things get heated!",
    "What did the buffalo say to his son when he left for college? Bison!",
    "Why did the computer go to the doctor? Because it had a virus!",
    "What do you call a fake stone? A shamrock!",
    "Why did the banana go to the doctor? It wasn't peeling well!",
    "What do you call a group of disorganized cats? A cat-astrophe!",
    "Why did the pencil go to school? To get sharper!",
    "What do you call a cow on a trampoline? A milkshake!",
    "Why did the chicken cross the playground? To get to the other slide!",
    "What do you call a fish that's good at basketball? A ball hog!",
    "Why did the math teacher call in sick? She had algebra!",
    "What do you call a cow that's just given birth? Decalfinated!",
    "Why did the cookie go to school? To become a smart cookie!",
    "What do you call a fish that's good at tennis? A racket fish!",
    "Why did the banana split? Because it saw the ice cream!",
    "What do you call a cow that's good at dancing? A moo-ver and shaker!",
    "Why did the apple go to the gym? To get some core strength!",
    "What do you call a fish that's good at soccer? A goal-fish!",
    "Why did the orange stop rolling? It ran out of juice!",
    "What do you call a cow that's good at comedy? A laugh-stock!",
    "Why did the grape stop in the middle of the road? Because it ran out of juice!",
    "What do you call a fish that's good at golf? A hole-in-one fish!",
    "Why did the lemon stop rolling? It was sour!",
    "What do you call a cow that's good at writing? A cow-thor!",
    "Why did the watermelon have a big wedding? Because it cantaloupe!",
    "What do you call a fish that's good at cooking? A chef-fish!",
    "Why did the strawberry cry? Because its parents were in a jam!",
    "What do you call a cow that's good at teaching? A cow-structor!",
    "Why did the peach go to the doctor? It had a pit in its stomach!",
    "What do you call a fish that's good at cleaning? A mop-fish!",
    "Why did the pineapple wear sunglasses? Because it was one cool fruit!",
    "What do you call a cow that's good at fixing things? A cow-mechanic!",
    "Why did the cherry go to the party? Because it was the cherry on top!",
    "What do you call a fish that's good at singing? A tuna!",
    "Why did the avocado refuse to jump? It was afraid of getting smashed!",
    "What do you call a cow that's good at magic? A moo-gician!",
    "Why did the blueberry go to school? To become more well-rounded!",
    "What do you call a fish that's good at photography? A snap-per!",
    "Why did the coconut go to the beach? To work on its tan!",
    "What do you call a cow that's good at detective work? A cow-p!",
    "Why did the mango go to the spa? To get a fruit facial!",
    "What do you call a fish that's good at construction? A hammer-head!",
    "Why did the kiwi move to New Zealand? Because it felt at home!",
    "What do you call a cow that's good at meteorology? A weather-cow!",
    "Why did the papaya go to the gym? To work on its core!",
    "What do you call a fish that's good at gardening? A plant-fish!",
    "Why did the dragon fruit breathe fire? Because it was having a bad day!",
    "What do you call a cow that's good at astronomy? A space-cow!",
    "Why did the star fruit shine so bright? Because it was a natural born star!",
    "What do you call a fish that's good at archaeology? A fossil fish!",
    "Why don't scientists trust atoms? Because they make up everything and they're always bonding!",
    "I told my wife she should embrace her mistakes. She gave me a big hug!",
    "What do you call a fake noodle? An impasta! But don't worry, it's still al-dente!",
    "Why did the scarecrow win an award? He was outstanding in his field, but he was also pretty corny!",
    "What do you call a sleeping bull? A bulldozer! And it's always having a moo-ving dream!",
    "Why don't eggs tell jokes? They'd crack each other up and make a real mess!",
    "What do you call a bear with no teeth? A gummy bear! Sweet but not very intimidating!",
    "Why did the math book look so sad? Because it was full of problems and nobody wanted to solve them!",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks! His insurance premiums are prehistoric!",
    "What did the ocean say to the beach? Nothing, it just waved! But it was shore thinking about it!",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one! That's par for the course!",
    "What do you call a factory that sells passable products? A satisfactory! Their quality is just okay-dokey!",
    "What's orange and sounds like a parrot? A carrot! But it's not very talkative!",
    "Why did the coffee file a police report? It got mugged! The perp was a real drip!",
    "What do you call a pig that does karate? A pork chop! He's got some serious ham-fu skills!",
    "What did one wall say to the other wall? I'll meet you at the corner! They're always supporting each other!",
    "What do you call a fish wearing a bowtie? Sofishticated! He's quite the catch at fancy parties!",
    "Why did the bicycle fall over? Because it was two-tired! It needed a wheel good rest!",
    "What do you call a parade of rabbits hopping backwards? A receding hare-line! Some-bunny needs to turn around!",
    "What did the grape say when it got stepped on? Nothing, it just let out a little wine! It was crushed!"
  ],
  "4": [
    "I'm reading a book about reverse psychology. Please don't buy it!",
    "What do you call a fish that needs help with his vocals? Auto-tuna!",
    "I used to be addicted to the Hokey Pokey, but I turned myself around!",
    "Why don't scientists trust atoms?",
    "What do you call a cow that plays a musical instrument? A moo-sician!",
    "I told my cat a joke about dogs. He didn't find it a-mew-sing!",
    "What's the difference between a poorly dressed person on a bike and a well-dressed person on a tricycle? Attire! But the tricycle guy has more balance in life!",
    "Why did the math book break up with the history book?",
    "What do you call a sleeping bull in a flower garden? A bulldozer in a bed of roses!",
    "I'm terrified of elevators, so I take steps to avoid them. It's an uplifting way to stay grounded!",
    "What did the left eye say to the right eye? Between you and me, something smells! It was a tear-able situation!",
    "Why don't eggs ever pay the restaurant bill? They always crack under pressure and scramble away!",
    "What do you call a bear with no teeth at a honey farm? A gummy bear having a sweet time, but he can't bear the sticky situation!",
    "I used to play piano by ear, but now I use my hands",
    "What's orange, sounds like a parrot, and is terrible at flying? A carrot with delusions! It's got a-peel but no wings!",
    "Why did the coffee file a police report at the donut shop? It got mugged by a glazed criminal!",
    "What do you call a pig that does karate in a deli? A pork chop with a side of ham-fu!",
    "What did one wall say to the other wall at the comedy club? I'll meet you at the corner for some structural humor! We're really holding up the show!",
    "Why don't scientists trust stairs in a laboratory?",
    "What do you call a fish wearing a bowtie at a sushi restaurant? Sofishticated and ready to be the catch of the day!",
    "What's the best thing about Switzerland besides the chocolate? I don't know, but the flag is a big plus and their watches are really timely!",
    "Why did the bicycle fall over at the race?",
    "What do you call a parade of rabbits hopping backwards down the street? A receding hare-line!",
    "What did the grape say when it got stepped on at the wine festival? Nothing, it just let out a little wine and got crushed by the experience!",
    "Why don't skeletons fight each other at Halloween parties? They don't have the guts and they're bone tired of conflict!",
    "What's the best way to watch a fly fishing tournament on TV? Live stream! It's reel entertainment that hooks you in!",
    "What do you call a cow with no legs in a field? Ground beef having a field day!",
    "Why did the cookie go to the doctor feeling crumbly?",
    "What's a skeleton's least favorite room in a haunted house? The living room! They prefer their spaces a little more dead-icated!",
    "Why did the tomato turn red at the salad bar? Because it saw the salad dressing and got saucy!",
    "What do you call a belt made of watches in a time zone? A waist of time!",
    "What do you call a deer with no eyes in the forest? No idea!",
    "Why did the stadium get hot after the baseball game? All the fans left!",
    "What do you call a can opener that doesn't work in the kitchen? A can't opener!",
    "Why don't oysters share at seafood restaurants? Because they're shellfish! They clam up when asked to give and are very shell-centered!",
    "What did the janitor say when he jumped out of the supply closet? Supplies! He really swept them off their feet with his cleaning humor!",
    "Why did the picture go to jail for a crime? Because it was framed!",
    "What do you call a dog magician at a pet show? A labracadabrador!",
    "What did the buffalo say to his son when he left for college in the prairie? Bison!",
    "Why did the computer go to the doctor with technical problems? Because it had a virus!",
    "What do you call a fake stone at a geology museum? A shamrock!",
    "Why did the banana go to the doctor feeling sick? It wasn't peeling well!",
    "What do you call a group of disorganized cats? A cat-astrophe!",
    "Why did the pencil go to school? To get sharper!",
    "What do you call a cow on a trampoline during a storm? A milkshake in a tornado!",
    "Why did the chicken cross the playground during recess? To get to the other slide!",
    "What do you call a fish that's good at basketball in the NBA? A ball hog with fins!",
    "Why did the math teacher call in sick during finals week? She had algebra and couldn't solve her own problems!",
    "What do you call a cow that's just given birth in the hospital? Decalfinated and exhausted!",
    "Why did the cookie go to school during exam season? To become a smart cookie and pass all its tests with flying crumbs!",
    "What do you call a fish that's good at tennis at Wimbledon? A racket fish with perfect form!",
    "Why did the banana split at the ice cream parlor?",
    "What do you call a cow that's good at dancing on Broadway? A moo-ver and shaker with serious stage presence!",
    "Why did the apple go to the gym during New Year's? To get some core strength and stick to its resolution!",
    "What do you call a fish that's good at soccer in the World Cup? A goal-fish with championship dreams!",
    "Why did the orange stop rolling down the hill? It ran out of juice halfway down!",
    "What do you call a cow that's good at comedy at the comedy club? A laugh-stock with perfect timing!",
    "Why did the grape stop in the middle of the marathon?",
    "What do you call a fish that's good at golf at the Masters? A hole-in-one fish with pro-level skills!",
    "Why did the lemon stop rolling in the citrus grove? It was sour about everything and had a bitter attitude towards life!",
    "What do you call a cow that's good at writing novels? A cow-thor with a bestselling series!",
    "Why did the watermelon have a big wedding in the summer?",
    "What do you call a fish that's good at cooking on TV? A chef-fish with his own cooking show!",
    "Why did the strawberry cry at the farmers market?",
    "What do you call a cow that's good at teaching math? A cow-structor with tenure!",
    "Why did the peach go to the doctor during flu season? It had a pit in its stomach and was feeling really down in the dumps!",
    "What do you call a fish that's good at cleaning houses professionally? A mop-fish with five-star reviews!",
    "Why did the pineapple wear sunglasses to the beach?",
    "What do you call a cow that's good at fixing cars? A cow-mechanic with her own garage!",
    "Why did the cherry go to the fancy party?",
    "What do you call a fish that's good at singing opera? A tuna with perfect pitch!",
    "Why did the avocado refuse to bungee jump? It was afraid of getting smashed and was playing it safe for once!",
    "What do you call a cow that's good at magic shows? A moo-gician with sold-out performances!",
    "Why did the blueberry go to college? To become more well-rounded and get a berry good education!",
    "What do you call a fish that's good at photography? A snap-per with an eye for detail!",
    "Why did the coconut go to the tropical beach resort? To work on its tan and become a little more golden brown!",
    "What do you call a cow that's good at detective work? A cow-p with a perfect solve rate!",
    "What do you call a fish that needs help with his vocals? Auto-tuna!",
    "I used to be addicted to the Hokey Pokey, but I turned myself around!",
    "What do you call a cow that plays a musical instrument? A moo-sician! But only if it's in a good moo-d!",
    "I told my cat a joke about dogs. He didn't find it a-mew-sing!",
    "What's the difference between a poorly dressed person on a bike and a well-dressed person on a tricycle? Attire! But the tricycle guy has more balance in life!",
    "Why did the math book break up with the history book? Because it had too many problems and couldn't count on the past!",
    "What do you call a sleeping bull in a flower garden? A bulldozer in a bed of roses! Beauty and the beast of napping!",
    "What did the left eye say to the right eye? Between you and me, something smells! It was a tear-able situation!",
    "Why don't eggs ever pay the restaurant bill? They always crack under pressure and scramble away!",
    "What do you call a bear with no teeth at a honey farm? A gummy bear having a sweet time, but he can't bear the sticky situation!",
    "What's orange, sounds like a parrot, and is terrible at flying? A carrot with delusions! It's got a-peel but no wings!",
    "Why did the coffee file a police report at the donut shop? It got mugged by a glazed criminal! The evidence was grounds for arrest!",
    "What do you call a pig that does karate in a deli? A pork chop with a side of ham-fu! He's bacon up the wrong tree!",
    "What did one wall say to the other wall at the comedy club? I'll meet you at the corner for some structural humor! We're really holding up the show!",
    "Why don't scientists trust stairs in a laboratory? Because they're always up to something and might cause a step-tical reaction!",
    "What do you call a fish wearing a bowtie at a sushi restaurant? Sofishticated and ready to be the catch of the day! Talk about dressed to krill!",
    "Why did the bicycle fall over at the race? Because it was two-tired from all the wheely hard training!",
    "What do you call a parade of rabbits hopping backwards down the street? A receding hare-line! Some-bunny should carrot about direction!",
    "What did the grape say when it got stepped on at the wine festival? Nothing, it just let out a little wine and got crushed by the experience!",
    "Why don't skeletons fight each other at Halloween parties? They don't have the guts and they're bone tired of conflict!"
  ],
  "5": [
    "I'm reading a book about reverse psychology while standing on my head. Please don't not avoid buying it upside down!",
    "What do you call a fish that needs help with his vocals while swimming backwards? Auto-tuna in reverse!",
    "I used to be addicted to the Hokey Pokey, but then I turned myself around, put my left foot in, took my right foot out, and shook it all about until I was cured!",
    "Why don't scientists trust atoms at molecular parties?",
    "What do you call a cow that plays a musical instrument in a barn band? A moo-sician!",
    "I told my cat a joke about dogs while he was napping. He didn't find it a-mew-sing, gave me a paws for concern, and said it was the cat's pajamas of bad humor!",
    "What's the difference between a poorly dressed person on a bike and a well-dressed person on a tricycle riding through a fashion district? Attire! But the tricycle guy has more balance in life, three times the style, and is wheely well-dressed!",
    "Why did the math book break up with the history book at the library?",
    "What do you call a sleeping bull in a flower garden during springtime? A bulldozer in a bed of roses having beauty sleep!",
    "I'm terrified of elevators, so I take steps to avoid them, use stairs to reach new heights, and find it's an uplifting way to stay grounded while stepping up my fitness game!",
    "What did the left eye say to the right eye during an emotional movie? Between you and me, something smells! It was a tear-able situation that really brought tears to their pupils and made them blink twice!",
    "Why don't eggs ever pay the restaurant bill at breakfast? They always crack under pressure, scramble away from responsibility, get beaten by the situation, and are always over-easy to avoid paying!",
    "What do you call a bear with no teeth at a honey farm during harvest season? A gummy bear having a sweet time, but he can't bear the sticky situation, finds it un-bear-ably sweet, and is just gumming up the works!",
    "I used to play piano by ear, but now I use my hands",
    "What's orange, sounds like a parrot, is terrible at flying, and thinks it's a bird? A carrot with delusions and aviation dreams! It's got a-peel but no wings, and its flying carrots are just pie in the sky!",
    "Why did the coffee file a police report at the donut shop during rush hour? It got mugged by a glazed criminal!",
    "What do you call a pig that does karate in a deli while ordering lunch? A pork chop with a side of ham-fu!",
    "What did one wall say to the other wall at the comedy club during open mic night? I'll meet you at the corner for some structural humor! We're really holding up the show, supporting each other's jokes, and our comedy is wall-to-wall entertainment!",
    "Why don't scientists trust stairs in a laboratory during experiments?",
    "What do you call a fish wearing a bowtie at a sushi restaurant for a formal dinner? Sofishticated and ready to be the catch of the day!",
    "What's the best thing about Switzerland besides the chocolate, watches, and Alps? I don't know, but the flag is a big plus, their neutrality is positively Swiss, and their cheese holes are grate for ventilation!",
    "Why did the bicycle fall over at the race during the final lap?",
    "What do you call a parade of rabbits hopping backwards down the street during Easter? A receding hare-line marching in reverse!",
    "What did the grape say when it got stepped on at the wine festival during harvest? Nothing, it just let out a little wine, got crushed by the experience, and decided to age gracefully into a fine whine!",
    "Why don't skeletons fight each other at Halloween parties during costume contests? They don't have the guts, are bone tired of conflict, lack the stomach for fighting, and their arguments are pretty skull-low!",
    "What's the best way to watch a fly fishing tournament on TV during fishing season? Live stream! It's reel entertainment that hooks you in, catches your attention, and really makes you want to scale up your viewing experience!",
    "What do you call a cow with no legs in a field during grazing season? Ground beef having a field day!",
    "Why did the cookie go to the doctor feeling crumbly during flu season?",
    "What's a skeleton's least favorite room in a haunted house during Halloween? The living room! They prefer their spaces a little more dead-icated, find it bone-chilling, and think it's got too much life in it!",
    "Why did the tomato turn red at the salad bar during lunch rush? Because it saw the salad dressing getting fresh and got saucy!",
    "What do you call a belt made of watches in a time zone during daylight savings? A waist of time!",
    "What do you call a deer with no eyes in the forest during hunting season? No idea!",
    "Why did the stadium get hot after the baseball game during summer? All the fans left!",
    "What do you call a can opener that doesn't work in the kitchen during dinner prep? A can't opener!",
    "Why don't oysters share at seafood restaurants during happy hour? Because they're shellfish! They clam up when asked to give, are very shell-centered, and think sharing is for the birds... or should I say fish!",
    "What did the janitor say when he jumped out of the supply closet during spring cleaning? Supplies! He really swept them off their feet with his cleaning humor, mopped the floor with that joke, and dusted off his best material!",
    "Why did the picture go to jail for a crime during an art heist? Because it was framed!",
    "What do you call a dog magician at a pet show during trick competition? A labracadabrador!",
    "What did the buffalo say to his son when he left for college in the prairie during graduation season? Bison!",
    "Why did the computer go to the doctor with technical problems during a system crash? Because it had a virus!",
    "What do you call a fake stone at a geology museum during rock week? A shamrock!",
    "Why did the banana go to the doctor feeling sick during fruit flu season? It wasn't peeling well!",
    "What do you call a group of disorganized cats during a cat show? A cat-astrophe!",
    "Why did the pencil go to school during back-to-school season? To get sharper!",
    "What do you call a fish that needs help with his vocals while swimming backwards? Auto-tuna in reverse! He's really going against the current of music!",
    "I used to be addicted to the Hokey Pokey, but then I turned myself around, put my left foot in, took my right foot out, and shook it all about until I was cured!",
    "What do you call a cow that plays a musical instrument in a barn band? A moo-sician! But only if it's in a good moo-d, doesn't have beef with the other animals, and can milk the performance for all it's worth!",
    "I told my cat a joke about dogs while he was napping. He didn't find it a-mew-sing, gave me a paws for concern, and said it was the cat's pajamas of bad humor!",
    "What's the difference between a poorly dressed person on a bike and a well-dressed person on a tricycle riding through a fashion district? Attire! But the tricycle guy has more balance in life, three times the style, and is wheely well-dressed!",
    "Why did the math book break up with the history book at the library? Because it had too many problems, couldn't count on the past, was divided by their differences, and their relationship just didn't add up to a sum-thing special!",
    "What do you call a sleeping bull in a flower garden during springtime? A bulldozer in a bed of roses having beauty sleep! It's beauty and the beast of napping, but he's really pushing up daisies in his dreams!",
    "What did the left eye say to the right eye during an emotional movie? Between you and me, something smells! It was a tear-able situation that really brought tears to their pupils and made them blink twice!",
    "Why don't eggs ever pay the restaurant bill at breakfast? They always crack under pressure, scramble away from responsibility, get beaten by the situation, and are always over-easy to avoid paying!",
    "What do you call a bear with no teeth at a honey farm during harvest season? A gummy bear having a sweet time, but he can't bear the sticky situation, finds it un-bear-ably sweet, and is just gumming up the works!",
    "What's orange, sounds like a parrot, is terrible at flying, and thinks it's a bird? A carrot with delusions and aviation dreams! It's got a-peel but no wings, and its flying carrots are just pie in the sky!",
    "Why did the coffee file a police report at the donut shop during rush hour? It got mugged by a glazed criminal! The evidence was grounds for arrest, the perp was a real drip, and the whole case was brewing with trouble!",
    "What do you call a pig that does karate in a deli while ordering lunch? A pork chop with a side of ham-fu! He's bacon up the wrong tree, bringing home the bacon with his martial arts, and his moves are simply ham-azing!",
    "What did one wall say to the other wall at the comedy club during open mic night? I'll meet you at the corner for some structural humor! We're really holding up the show, supporting each other's jokes, and our comedy is wall-to-wall entertainment!",
    "Why don't scientists trust stairs in a laboratory during experiments? Because they're always up to something, might cause a step-tical reaction, are taking research to the next level, and their results are always a step above the rest!"
  ]
}