{
  "1": [
    "I used to hate facial hair, but then it grew on me.",
    "I'm reading a book about anti-gravity. It's impossible to put down.",
    "I wondered why the baseball kept getting bigger. Then it hit me.",
    "The math teacher called in sick with algebra.",
    "I lost my job at the bank. A woman asked me to check her balance, so I pushed her over.",
    "Time flies like an arrow. Fruit flies like a banana.",
    "I used to be a banker, but I lost interest.",
    "The graveyard is so crowded, people are dying to get in.",
    "I'm terrified of elevators, so I take steps to avoid them.",
    "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
    "I only know 25 letters of the alphabet. I don't know Y.",
    "What do you call a fish wearing a crown? A king fish.",
    "I'm on a seafood diet. I see food and I eat it.",
    "The early bird might get the worm, but the second mouse gets the cheese.",
    "I used to play piano by ear, but now I use my hands.",
    "What's the best thing about Switzerland? I don't know, but the flag is a big plus.",
    "I haven't slept for ten days",
    "A bicycle can't stand on its own",
    "What do you call a parade of rabbits hopping backwards? A receding hare-line.",
    "I'm reading a book on the history of glue – can't put it down.",
    "What did the ocean say to the beach? Nothing, it just waved.",
    "Why don't scientists trust atoms?",
    "I told my wife she was drawing her eyebrows too high. She looked surprised.",
    "What's orange and sounds like a parrot? A carrot.",
    "I used to be addicted to soap, but I'm clean now.",
    "What do you call a sleeping bull? A bulldozer.",
    "Why did the scarecrow win an award? He was outstanding in his field.",
    "What do you call a bear with no teeth? A gummy bear.",
    "I'm afraid for the calendar. Its days are numbered.",
    "What do you call a fake noodle? An impasta.",
    "Why don't eggs tell jokes? They'd crack each other up.",
    "What's the difference between a fish and a piano? You can't tuna fish.",
    "I invented a new word: Plagiarism.",
    "What did one wall say to the other wall? I'll meet you at the corner.",
    "Why did the coffee file a police report? It got mugged.",
    "What do you call a dinosaur that crashes his car? Tyrannosaurus Wrecks.",
    "I would avoid the sushi if I was you. It's a little fishy.",
    "What do you call a pig that does karate? A pork chop.",
    "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
    "What do you call a factory that makes okay products? A satisfactory.",
    "Dear Math, grow up and solve your own problems.",
    "What did the grape say when it got stepped on? Nothing, it just let out a little wine.",
    "Why don't skeletons fight each other? They don't have the guts.",
    "What's the best way to watch a fly fishing tournament? Live stream.",
    "I'm on a whiskey diet. I've lost three days already.",
    "What do you call a cow with two legs? Lean beef.",
    "I named my horse Mayo. Sometimes Mayo neighs.",
    "What's the difference between a poorly dressed man and a tired dog? One wears a suit, the other pants.",
    "I used to work at a calendar factory but got fired for taking a day off.",
    "What do you call a detective alligator? An investi-gator.",
    "I'm addicted to brake fluid, but I can stop anytime.",
    "What do you call a bee that can't make up its mind? A maybe.",
    "I used to be a shoe salesman, but I lost my sole.",
    "What do you call a rabbit that works in a bakery? A yeasted bunny.",
    "I bought a dog from a blacksmith. As soon as I got home, he made a bolt for the door.",
    "I'm reading a book about mazes. I got lost in it.",
    "What do you call a fish that practices medicine? A sturgeon.",
    "I used to be afraid of hurdles, but I got over it.",
    "What do you call a sheep with no legs? A cloud.",
    "I used to work in a blanket factory, until it folded.",
    "What do you call a dinosaur that loves to sleep? A dino-snore.",
    "What do you call a belt made out of watches? A waist of time.",
    "What's the difference between a cat and a comma? A cat has claws at the end of paws, and a comma is a pause at the end of a clause.",
    "I bought some shoes from a drug dealer. I don't know what he laced them with, but I was tripping all day.",
    "What do you call a fish wearing a bowtie? Sofishticated.",
    "What do you call a cow with a twitch? Beef jerky.",
    "I told a chemistry joke, but there was no reaction.",
    "What do you call a pile of cats? A meowtain.",
    "I used to be a tailor, but I wasn't suited for it.",
    "What do you call a deer with no eyes? No-eye-deer.",
    "I'm reading a book about teleportation. It's bound to take me places.",
    "What do you call a fish that needs help with vocals? Auto-tuna.",
    "I used to work at a shoe recycling shop. It was sole destroying.",
    "What do you call a group of disorganized cats? A cat-astrophe.",
    "I'm addicted to collecting vintage timepieces. It's about time.",
    "What do you call a cow that can play a musical instrument? A moo-sician.",
    "What's the difference between a well-dressed man on a bicycle and a poorly dressed man on a tricycle? Attire.",
    "I told my wife she should embrace her mistakes. She gave me a hug.",
    "I'm reading a book about reverse psychology. Do not read it.",
    "I'm afraid of speed bumps, but I'm slowly getting over it.",
    "What do you call a dog that can do magic? A labracadabrador.",
    "I'm reading a book about parallel lines. They'll never meet.",
    "What do you call a train carrying bubblegum? A chew-chew train.",
    "I used to work in a mirror factory, but I could see myself doing something else.",
    "What do you call a computer that sings? A Dell.",
    "I'm reading a book on the history of elevators. It has its ups and downs.",
    "What do you call a cow with a sense of humor? Laughing stock.",
    "What do you call a fish wearing headphones? Bass-boosted.",
    "What do you call a sleepy grizzly bear? A bear minimum.",
    "What do you call a cheese that isn't yours? Nacho cheese.",
    "I used to work at a juice bar, but I got canned.",
    "I'm reading a book about submarines. It's deep.",
    "What do you call a cow on a trampoline? A milkshake.",
    "I used to work at a shoe store, but I couldn't fit in.",
    "What do you call a bear in the rain? A drizzly bear.",
    "What do you call a nosy pepper? Jalapeño business.",
    "I used to work at a stationery store, but I didn't feel like I was going anywhere.",
    "I'm reading a thriller about an optometrist. It's an eye-opener.",
    "What do you call a cow that doesn't give milk? A milk dud.",
    "I used to be a lifeguard, but this blue kid got me fired.",
    "What do you call a dog that can't bark? A hush puppy.",
    "I told my wife she should do lunges to stay in shape. That would be a big step forward.",
    "I'm reading a book about adhesives. I can't put it down.",
    "What do you call a snobby criminal going downstairs? A condescending con descending.",
    "What do you call a psychic midget who escaped from prison? A small medium at large.",
    "What do you call a man with no body and no nose? Nobody knows.",
    "I used to work at a soft drink can crushing company. It was soda pressing.",
    "What do you call a Russian tree? Dimitri.",
    "I used to work at a restaurant called 'The Flying Pan.' I had to quit",
    "What do you call a nervous javelin thrower? Shakespeare.",
    "I used to work at a shoe store, but I got the boot.",
    "I used to work at a dry cleaner, but I got pressed for time.",
    "I used to work at a cemetery, but I got fired for not being serious enough.",
    "What do you call a dog that can play guitar? A golden retriever.",
    "I used to work at a candy factory, but I got fired for being too sweet.",
    "I used to work at a hotel, but I got fired for not being accommodating.",
    "I used to work at a bakery, but I couldn't make enough dough."
  ],
  "2": [
    "Why did the math book look so sad?",
    "I'm terrified of elevators, I'll take the stairs instead.",
    "Why did the bicycle fall over?",
    "Why did the cookie go to the doctor?",
    "What's a skeleton's least favorite room in the house? The living room!",
    "Why did the tomato turn red?",
    "Why did the stadium get hot? All the fans left!",
    "What do you call a boomerang that won't come back? A stick!",
    "I used to be addicted to the Hokey Pokey, but I turned myself around.",
    "Why did the picture go to jail? It was framed!",
    "What do you call a fake stone? A shamrock!",
    "Why did the pencil go to school? To get sharper!",
    "Why don't oysters share?",
    "Why did the math teacher call in sick? She had algebra.",
    "Why did the chicken cross the playground? To get to the other slide!",
    "I used to work at a library, but I got shushed too much.",
    "I used to work at a hotel, but I couldn't handle the suite life.",
    "Why did the banana split?",
    "What do you call a fish that's good at basketball? A ball hog.",
    "Why did the apple go to the gym? To get some core strength!",
    "What do you call a cow that's just given birth? Decalfinated.",
    "I used to work at a flower shop, but I couldn't handle the pollen pressure.",
    "What do you call a fish that's good at tennis? A racket fish.",
    "Why did the orange stop rolling? It ran out of juice!",
    "What do you call a cow that's good at math? A calcu-later.",
    "I used to work at a clock factory, but I got tired of the time.",
    "Why did the grape stop in the middle of the road?",
    "What do you call a cow that's good at dancing? A moo-ver and shaker.",
    "I used to work at a paper factory, but it was tearable.",
    "What do you call a fish that's good at golf? A hole-in-one fish.",
    "Why did the lemon stop rolling? It was sour!",
    "What do you call a cow that's good at singing? A moo-sician.",
    "I used to work at a rubber band factory, but it was too stretching.",
    "Why did the watermelon have a big wedding?",
    "What do you call a cow that's good at comedy? A laugh-stock.",
    "I used to work at a mattress factory, but it was a sleepy job.",
    "Why did the strawberry cry?",
    "What do you call a cow that's good at teaching? A cow-structor."
  ],
  "3": [
    "What do you call a can opener that doesn't work? A can't opener!",
    "What did the janitor say when he jumped out of the closet? Supplies! He really swept them off their feet!",
    "What did the buffalo say to his son when he left for college? Bison!",
    "Why did the pineapple wear sunglasses? Because it was one cool fruit!",
    "What do you call a cow that's good at fixing things? A cow-mechanic!",
    "Why did the cherry go to the party? Because it was the cherry on top!",
    "Why did the avocado refuse to jump? It was afraid of getting smashed!",
    "Why did the blueberry go to school? To become more well-rounded!",
    "What do you call a fish that's good at photography? A snap-per!",
    "Why did the coconut go to the beach? To work on its tan!",
    "What do you call a cow that's good at detective work? A cow-p!",
    "Why did the mango go to the spa? To get a fruit facial!",
    "What do you call a fish that's good at construction? A hammer-head!",
    "Why did the kiwi move to New Zealand? Because it felt at home!",
    "What do you call a cow that's good at meteorology? A weather-cow!",
    "Why did the papaya go to the gym? To work on its core!",
    "What do you call a fish that's good at gardening? A plant-fish!",
    "Why did the dragon fruit breathe fire? Because it was having a bad day!",
    "What do you call a cow that's good at astronomy? A space-cow!",
    "Why did the star fruit shine so bright? Because it was a natural born star!",
    "What do you call a fish that's good at archaeology? A fossil fish!"
  ],
  "4": [
    "I told my cat a joke about dogs. He didn't find it a-mew-sing!",
    "Why did the math book break up with the history book?",
    "What did the left eye say to the right eye? Between you and me, something smells! It was a tear-able situation!",
    "Why don't eggs ever pay the restaurant bill? They always crack under pressure and scramble away!",
    "What do you call a cow that's good at writing novels? A cow-thor with a bestselling series!",
    "What do you call a fish that's good at cooking on TV? A chef-fish with his own cooking show!",
    "What do you call a fish that's good at cleaning houses professionally? A mop-fish with five-star reviews!",
    "What do you call a fish that's good at singing opera? A tuna with perfect pitch!",
    "What do you call a cow that's good at magic shows? A moo-gician with sold-out performances!"
  ],
  "5": [
    "What do you call a dog magician at a pet show during trick competition? A labracadabrador!"
  ]
}